In [ ]:
import pandas as pd
import os
from google.colab import drive

In [ ]:
pd.set_option('display.max_columns', None)
# display.[max_categories, max_columns, max_colwidth, max_dir_items,
#   max_info_columns, max_info_rows, max_rows, max_seq_items, memory_usage,
#   min_rows, multi_sparse, notebook_repr_html, pprint_nest_depth, precision,
#   show_dimensions]

In [ ]:
# 나의 구글 드라이브 연결
drive.mount("/content/drive")

Mounted at /content/drive

In [ ]:
path = './drive/MyDrive/Colab Notebooks/'

# 데이터 불러오기

In [ ]:
# 등산로 관심인구 정보
df1 = pd.read_csv(path + "FPL020101.csv")
# 등산로 선호 관광 장소
df2 = pd.read_csv(path + "FPL020501.csv")
# 등산로 관심인구 관심사/관심분야 (포털 검색 분야) 정보
df3 = pd.read_csv(path + "FPL020801.csv")

# 국립공원 관심인구 정보
df4 = pd.read_csv(path + "FPL030101.csv")
# 국립공원 관심인구 라이프스타일 (온라인쇼핑몰 이용 카테고리 정보)
df5 = pd.read_csv(path + "FPL030701.csv")

# 자전거코스/자전거길 관심인구 정보
df6 = pd.read_csv(path + "FPL040101.csv")
# 자전거코스/자전거길 관심인구 자전거용품 검색 정보
df7 = pd.read_csv(path + "FPL040401.csv")

# 산림치유원 관심인구 선호 산림치유원 검색 정보
df8 = pd.read_csv(path + "FPL050201.csv")

# 산림체험 관심인구 정보
df14 = pd.read_csv(path + "FPL060101.csv")
# 산림체험 관심인구 선호 산림체험장소 검색 정보
df15 = pd.read_csv(path + "FPL060201.csv")
# 산림체험 관심인구 선호 산림체험 프로그램 검색 정보
df16 = pd.read_csv(path + "FPL060301.csv")

# 산림치유 관심인구 라이프스타일 (온라인쇼핑몰 검색/구매 카테고리) 정보
df17 = pd.read_csv(path + "FPL060501.csv")

# 귀산촌 관심인구 정보
df18 = pd.read_csv(path + "FPL070101.csv")

# 산림재해 관심인구 정보
df19 = pd.read_csv(path + "FPL080101.csv")
# 산림대피소 관심인구 정보
df20 = pd.read_csv(path + "FPL080201.csv")
# 산림재해 관심인구 관심지역 검색정보
df21 = pd.read_csv(path + "FPL080301.csv")
# 산림재해 연관 검색 키워드를 검색한 관심인구 정보
df22 = pd.read_csv(path + "FPL080401.csv")

# 전국 국립공원 등산로 이용자 분류(성/연령)별 평균 칼로리 소모량 정보
df23 = pd.read_csv(path + "PARK_KCAL.csv")

# 등산로[hiking trail]
> 등산 할 수 있도록 나 있는 길.

### df1 : 등산로 관심인구 정보 (Total : 30,692)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230 | 서울 | 경기 | 부산 | 대구 | 인천 |
|등산로 | 금강산 | 금계산 | 백두산 | 우장산 | 수락산 |
|거주지 20 | 서울 | 경기 | 부산 | 경북 | 충북 |
|등산로 | 우장산 | 고성산 | 금계산 | 마이산 | 아차산 |
|거주지 30 | 서울 | 경기 | 경남 | 대구 | 인천 |
|등산로 | 금강산 | 수락산 | 도덕산 | 금계산 | 백두산 |
|||||||
|거주지 14560 | 서울 | 경기 | 부산 | 인천 | 광주 |
|등산로 | 금강산 | 우장산 | 백두산 | 금계산 | 설악산 |

`[2-30] 여 : 13,523(80.2%), 남 : 3,341(19.8%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|16,864(54.9%)|8,316(49.3%)|11,059(65.6%)|
|20|3,556(11.6%)|1,279(7.6%)|1,960(11.6%)|
|30|13,308(43.4%)|7,037(41.7%)|9,099(54.0%)|

---

### df2 : 등산로 선호 관광 장소 (Total : 15,308)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230 | 서울 | 경기 | 부산 | 인천 | 강원 |
|선호관광 | 해운대 | 공릉 | 장흥 | 주문진 | 수승대 |
|거주지 20 | 경기 | 부산 | 서울 | 강원 | 인천 |
|선호관광 (경기) | 해운대 | 대천해수욕장 | 남원 | 예당 | 공릉 |
|거주지 30 | 서울 | 경기 | 부산 | 인천 | 충남 |
|선호관광 | 해운대 | 공릉 | 장흥 | 수승대 | 주문진 |
|||||||
|거주지 14560 | 서울 | 경기 | 부산 | 전북 | 광주 |
|선호관광 | 해운대 | 봉은사 | 공릉 | 울릉도 | 주문진 |

`[2-30] 여 : 7,936(85.1%), 남 : 1,393(14.9%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|9,329(60.9%)|4,161(44.6%)|5,241(56.2%)|
|20|1,923(12.6%)|713(7.6%)|917(9.8%)|
|30|7,406(48.4%)|3,448(37.0%)|4,324(46.4%)|


---

### df3 : 등산로 관심인구 관심사/관심분야 (포털 검색 분야) 정보(포털 검색 분야) 정보 (Total : 873,021)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230 | 서울 | 경기 | 부산 | 인천 | 대구 |
|주요관심 | 스포츠 | TV연예 | 사회 | 경제 | 정치 |
|거주지 20 | 서울 | 경기 | 인천 | 대구 | 충북 |
|주요관심 | 스포츠 | TV연예 | 경제 | 사회 | 정치 |
|거주지 30 | 서울 | 경기 | 부산 | 인천 | 충남 |
|주요관심 | 스포츠 | TV연예 | 사회 | 정치 | 경제 |
|||||||
|거주지 14560 | 서울 | 경기 | 인천 | 대전 | 대구 |
|주요관심 | 스포츠 | 사회 | TV연예 | 경제 | 정치 |

`[2-30] 여 : 217,248(45.7%), 남 : 257,833(54.3%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|475,081(54.4%)|243,532(51.3%)|318,786(67.1%)|
|20|124,283(14.2%)|40,125(8.4%)|60,574(12.8%)|
|30|350,798(40.2%)|203,407(42.8%)|258,212(54.4%)|

10대는 부모의 영향

---
---
# 등산로 관심인구 정보

In [ ]:
df1.head()

,산,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,지리산,지리산,M,3,"사무직 (일반사무직, 공무원, 직업군인)",600~699만원,아니오,,연립주택/ 다세대/ 빌라,서울,동대문구,답십리2동,"경차 (모닝, 스파크 등)"
1,지리산,지리산 : 네이버 통합검색,M,3,"사무직 (일반사무직, 공무원, 직업군인)",600~699만원,아니오,,연립주택/ 다세대/ 빌라,서울,동대문구,답십리2동,"경차 (모닝, 스파크 등)"
2,서운산,서운산자연휴양림 : 네이버 통합검색,M,4,"전문직 (의사, 판검사, 예술가, 종교인)",900~999만원,예,자녀 있음,아파트/ 주상복합,서울,노원구,상계6.7동,"준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)"
3,서운산,출장길에 만난 깔끔한 서운산자연휴양림(안산) : 네이버 블로그,M,4,"전문직 (의사, 판검사, 예술가, 종교인)",900~999만원,예,자녀 있음,아파트/ 주상복합,서울,노원구,상계6.7동,"준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)"
4,서운산,#36. 서운산 자연휴양림 오토캠핑장 2박3일 : 네이버 블로그,M,4,"전문직 (의사, 판검사, 예술가, 종교인)",900~999만원,예,자녀 있음,아파트/ 주상복합,서울,노원구,상계6.7동,"준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)"

In [ ]:
counts = df1['연령'].value_counts()
counts

3    13308
4     9442
5     4316
2     3556
6       42
1       28
Name: 연령, dtype: int64

In [ ]:
round(counts.loc[[2,3]].sum() / counts.sum() * 100, 1),\
round(counts.loc[2] / counts.sum() * 100, 1),\
round(counts.loc[3] / counts.sum() * 100, 1),\
round(counts.drop([2,3]).sum() / counts.sum() * 100, 1)

(54.9, 11.6, 43.4, 45.1)

In [ ]:
# Total : 30,692
df1_23 = df1[df1['연령'].isin([2, 3])]     # 16,864, 54.9%
df1_2 = df1[(df1['연령'] == 2)]            #  3,556, 11.6%
df1_3 = df1[(df1['연령'] == 3)]            # 13,308, 43.4%
df1_1456 = df1[df1['연령'].isin([1, 4, 5, 6])] # 13,828, 45.1%

In [ ]:
df1_23.head()

,산,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,지리산,지리산,M,3,"사무직 (일반사무직, 공무원, 직업군인)",600~699만원,아니오,,연립주택/ 다세대/ 빌라,서울,동대문구,답십리2동,"경차 (모닝, 스파크 등)"
1,지리산,지리산 : 네이버 통합검색,M,3,"사무직 (일반사무직, 공무원, 직업군인)",600~699만원,아니오,,연립주택/ 다세대/ 빌라,서울,동대문구,답십리2동,"경차 (모닝, 스파크 등)"
21,한라산,한라산이 사라졌다…청정의 섬 제주도 온종일 회색빛,F,3,"사무직 (일반사무직, 공무원, 직업군인)",100~199만원,아니오,,연립주택/ 다세대/ 빌라,경기,수원시 권선구,권선동,NaN
29,무등산,광주 럭셔리하우스 무등산 시그니에 : 네이버 블로그,F,3,"사무직 (일반사무직, 공무원, 직업군인)",300~399만원,아니오,,아파트/ 주상복합,광주,북구,두암3동,NaN
30,무등산,산수동 무등산 시그니에 시그니처 단독 주택 타운하우스 : 네이버 블로그,F,3,"사무직 (일반사무직, 공무원, 직업군인)",300~399만원,아니오,,아파트/ 주상복합,광주,북구,두암3동,NaN

### 230대 성별

In [ ]:
sex_counts = df1_23['성별'].value_counts()
sex_counts

F    13523
M     3341
Name: 성별, dtype: int64

In [ ]:
round(sex_counts.loc['F'] / sex_counts.sum() * 100 , 1),\
round(sex_counts.loc['M'] / sex_counts.sum() * 100 , 1)

(80.2, 19.8)

### 230대 직업

In [ ]:
df1_23['직업'].notnull().sum(), df1_23['소득'].notnull().sum()

(16847, 16847)

In [ ]:
job_counts = df1_23['직업'].value_counts()
job_counts

사무직 (일반사무직, 공무원, 직업군인)             6314
주부 (전업주부, 파트타임 근무 주부)              3882
전문직 (의사, 판검사, 예술가, 종교인)            1290
학생 (초중고학생, 대학생, 대학원생)              1229
교직 (교사, 유치원교사, 학원강사)               1173
서비스직 (요식업, 숙박업, 미용실종업원)             701
무직                                  646
자영업 (도소매업, 숙박업, 미용업)                537
관리직 (사장, 간부, 고위공무원)                 353
기능직 (자동차정비, 운전기사, 안경사, 택시기사)        274
기타                                  169
생산/노무직 (생산감독, 경비원, 공장근로자)           159
판매직 (상점점원, 보험설계사, 노점상)               86
퇴직/연금생활자                             31
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)       3
Name: 직업, dtype: int64

In [ ]:
drop_jobs = job_counts[job_counts.index.str.contains('학생|퇴직|주부')]
drop_jobs

주부 (전업주부, 파트타임 근무 주부)    3882
학생 (초중고학생, 대학생, 대학원생)    1229
퇴직/연금생활자                   31
Name: 직업, dtype: int64

In [ ]:
round((job_counts.sum() - drop_jobs.sum() - 646) / len(df1_23) * 100, 1),\
job_counts.sum() - drop_jobs.sum() - 646

(65.6, 11059)

In [ ]:
job2_counts = df1_2['직업'].value_counts() # 310 무직
job3_counts = df1_3['직업'].value_counts() # 336 무직

학생 (초중고학생, 대학생, 대학원생)           1098
사무직 (일반사무직, 공무원, 직업군인)           951
무직                               310
관리직 (사장, 간부, 고위공무원)              288
자영업 (도소매업, 숙박업, 미용업)             175
주부 (전업주부, 파트타임 근무 주부)            164
전문직 (의사, 판검사, 예술가, 종교인)          155
생산/노무직 (생산감독, 경비원, 공장근로자)        100
기능직 (자동차정비, 운전기사, 안경사, 택시기사)      82
기타                                69
교직 (교사, 유치원교사, 학원강사)              61
서비스직 (요식업, 숙박업, 미용실종업원)           51
판매직 (상점점원, 보험설계사, 노점상)            28
퇴직/연금생활자                          18
Name: 직업, dtype: int64

In [ ]:
drop2_jobs = job2_counts[job2_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs = job3_counts[job3_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs

주부 (전업주부, 파트타임 근무 주부)    3718
학생 (초중고학생, 대학생, 대학원생)     131
퇴직/연금생활자                   13
Name: 직업, dtype: int64

In [ ]:
round((job2_counts.sum() - drop2_jobs.sum() - 310) / len(df1_23) * 100, 1),\
job2_counts.sum() - drop2_jobs.sum() - 310,\
round((job3_counts.sum() - drop3_jobs.sum() - 336) / len(df1_23) * 100, 1),\
job3_counts.sum() - drop3_jobs.sum() - 336

(11.6, 1960, 54.0, 9099)

### 230대 자동차

In [ ]:
car_counts = df1_23['자동차'].value_counts()
car_counts

준중형차 (아반떼, K3, 크루즈, 제타급 등)          2684
경차 (모닝, 스파크 등)                      1296
중형차 (쏘나타, K5, 말리부, 골프급 등)           1161
준중형SUV (투싼, 스포티지, QM5, 티구안급 등)       566
준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)     523
소형SUV/CUV (티볼리, QM3 등)               474
MPV (카니발, 올란도, 피카소급, 오딧세이 등)         448
중형SUV (싼타페, 쏘렌토, 캡티바, BMW X3급 등)     423
대형차 (제너시스, BMW5급 등)                  275
소형차 (액센트, 프라이드, 아베오, 피아트급 등)         207
대형SUV (베라크루즈, 모하비, 투아렉급 등)           116
준중형파생 (벨로스터, I30 등)                  107
기타 (승합차/트럭/화물차/기타 차량 등)               18
스포츠 (제네시스 쿠페, BMW M, 벤츠 AMG 등)        16
프리미엄 (에쿠스, BMW7급 등)                    2
Name: 자동차, dtype: int64

In [ ]:
round(car_counts.sum() / len(df1_23) * 100, 1),\
car_counts.sum()

(49.3, 8316)

In [ ]:
car2_counts = df1_2['자동차'].value_counts()
car3_counts = df1_3['자동차'].value_counts()

round(car2_counts.sum() / len(df1_23) * 100, 1),\
car2_counts.sum(),\
round(car3_counts.sum() / len(df1_23) * 100, 1),\
car3_counts.sum()

(7.6, 1279, 41.7, 7037)

In [ ]:
df1_23['시도'].value_counts()[:5],\
df1_2['시도'].value_counts()[:5],\
df1_3['시도'].value_counts()[:5]

(서울    5248
 경기    3549
 부산    1165
 대구     923
 인천     921
 Name: 시도, dtype: int64,
 서울    991
 경기    720
 부산    545
 경북    308
 충북    154
 Name: 시도, dtype: int64,
 서울    4257
 경기    2829
 경남     851
 대구     822
 인천     778
 Name: 시도, dtype: int64)

In [ ]:
df1_23[df1_23['시도'] == "서울"]['산'].value_counts()[:5],\
df1_2[df1_2['시도'] == "서울"]['산'].value_counts()[:5],\
df1_3[df1_3['시도'] == "서울"]['산'].value_counts()[:5]

(금강산    234
 금계산    205
 백두산    189
 우장산    175
 수락산    172
 Name: 산, dtype: int64,
 우장산    129
 고성산     63
 금계산     56
 마이산     43
 아차산     41
 Name: 산, dtype: int64,
 금강산    203
 수락산    165
 도덕산    158
 금계산    149
 백두산    149
 Name: 산, dtype: int64)

In [ ]:
df1_1456['시도'].value_counts()[:5],\
df1_1456[df1_1456['시도'] == "서울"]['산'].value_counts()[:5]

(서울    5857
 경기    3585
 부산     672
 인천     648
 광주     579
 Name: 시도, dtype: int64,
 금강산    246
 우장산    242
 백두산    217
 금계산    207
 설악산    204
 Name: 산, dtype: int64)

# df2 : 등산로 선호 관광 장소 (Total : 15,308)

In [ ]:
df2.head()

,선호관광,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,남원,[남원 -전북] 시골집 - 수제돈가스국수 전문점 : 네이버 블로그,F,3,"판매직 (상점점원, 보험설계사, 노점상)",200~299만원,예,자녀 있음,단독주택,전북,장수군,천천면,NaN
1,남원,남원 맛집 : 네이버 통합검색,F,3,"판매직 (상점점원, 보험설계사, 노점상)",200~299만원,예,자녀 있음,단독주택,전북,장수군,천천면,NaN
2,남원,남원 맛집 근사한 한끼 : 네이버 블로그,F,3,"판매직 (상점점원, 보험설계사, 노점상)",200~299만원,예,자녀 있음,단독주택,전북,장수군,천천면,NaN
3,남원,제주 남원 맛집 며칠 내내 폭식쓰~ : 네이버 블로그,F,3,"판매직 (상점점원, 보험설계사, 노점상)",200~299만원,예,자녀 있음,단독주택,전북,장수군,천천면,NaN
4,남원,전북남원 맛집 : 네이버 플레이스 검색 결과,F,3,"판매직 (상점점원, 보험설계사, 노점상)",200~299만원,예,자녀 있음,단독주택,전북,장수군,천천면,NaN

### 연령

In [ ]:
age_counts = df2['연령'].value_counts()
age_counts

3    7406
4    4499
2    1923
5    1408
1      44
6      28
Name: 연령, dtype: int64

In [ ]:
age_counts.loc[[2,3]].sum(), round(age_counts.loc[[2,3]].sum() / age_counts.sum() * 100, 1),\
age_counts.loc[2], round(age_counts.loc[2] / age_counts.sum() * 100, 1),\
age_counts.loc[3], round(age_counts.loc[3] / age_counts.sum() * 100, 1),\
age_counts.drop([2,3]).sum(), round(age_counts.drop([2,3]).sum() / age_counts.sum() * 100, 1)

(9329, 60.9, 1923, 12.6, 7406, 48.4, 5979, 39.1)

In [ ]:
df2_23 = df2[df2['연령'].isin([2, 3])]
df2_2 = df2[(df2['연령'] == 2)]
df2_3 = df2[(df2['연령'] == 3)]
df2_1456 = df2[df2['연령'].isin([1, 4, 5, 6])]

### 230대 성별

In [ ]:
sex_counts = df2_23['성별'].value_counts()
sex_counts

F    7936
M    1393
Name: 성별, dtype: int64

In [ ]:
round(sex_counts.loc['F'] / sex_counts.sum() * 100 , 1),\
round(sex_counts.loc['M'] / sex_counts.sum() * 100 , 1)

(85.1, 14.9)

### 230대 직업

In [ ]:
job_counts = df2_23['직업'].value_counts()
job_counts

주부 (전업주부, 파트타임 근무 주부)              3156
사무직 (일반사무직, 공무원, 직업군인)             2887
교직 (교사, 유치원교사, 학원강사)                632
전문직 (의사, 판검사, 예술가, 종교인)             572
학생 (초중고학생, 대학생, 대학원생)               524
자영업 (도소매업, 숙박업, 미용업)                403
무직                                  392
서비스직 (요식업, 숙박업, 미용실종업원)             298
기능직 (자동차정비, 운전기사, 안경사, 택시기사)        144
생산/노무직 (생산감독, 경비원, 공장근로자)            98
기타                                   86
판매직 (상점점원, 보험설계사, 노점상)               58
관리직 (사장, 간부, 고위공무원)                  51
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)      12
퇴직/연금생활자                             11
Name: 직업, dtype: int64

In [ ]:
drop_jobs = job_counts[job_counts.index.str.contains('학생|퇴직|주부')]
drop_jobs

주부 (전업주부, 파트타임 근무 주부)    3156
학생 (초중고학생, 대학생, 대학원생)     524
퇴직/연금생활자                   11
Name: 직업, dtype: int64

In [ ]:
round((job_counts.sum() - drop_jobs.sum() - 392) / len(df2_23) * 100, 1),\
job_counts.sum() - drop_jobs.sum() - 392

(56.2, 5241)

In [ ]:
job2_counts = df2_2['직업'].value_counts() # 215 무직
job3_counts = df2_3['직업'].value_counts() # 177 무직

In [ ]:
drop2_jobs = job2_counts[job2_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs = job3_counts[job3_counts.index.str.contains('학생|퇴직|주부')]

In [ ]:
round((job2_counts.sum() - drop2_jobs.sum() - 215) / len(df2_23) * 100, 1),\
job2_counts.sum() - drop2_jobs.sum() - 215,\
round((job3_counts.sum() - drop3_jobs.sum() - 177) / len(df2_23) * 100, 1),\
job3_counts.sum() - drop3_jobs.sum() - 177

(9.8, 917, 46.4, 4324)

### 230대 자동차

In [ ]:
car_counts = df2_23['자동차'].value_counts()
car_counts

준중형차 (아반떼, K3, 크루즈, 제타급 등)          1034
경차 (모닝, 스파크 등)                       698
중형차 (쏘나타, K5, 말리부, 골프급 등)            604
준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)     427
준중형SUV (투싼, 스포티지, QM5, 티구안급 등)       393
소형SUV/CUV (티볼리, QM3 등)               280
소형차 (액센트, 프라이드, 아베오, 피아트급 등)         156
중형SUV (싼타페, 쏘렌토, 캡티바, BMW X3급 등)     152
MPV (카니발, 올란도, 피카소급, 오딧세이 등)         127
대형차 (제너시스, BMW5급 등)                   95
준중형파생 (벨로스터, I30 등)                   86
대형SUV (베라크루즈, 모하비, 투아렉급 등)            67
스포츠 (제네시스 쿠페, BMW M, 벤츠 AMG 등)        35
기타 (승합차/트럭/화물차/기타 차량 등)                7
Name: 자동차, dtype: int64

In [ ]:
round(car_counts.sum() / len(df2_23) * 100, 1),\
car_counts.sum()

(44.6, 4161)

In [ ]:
car2_counts = df2_2['자동차'].value_counts()
car3_counts = df2_3['자동차'].value_counts()

round(car2_counts.sum() / len(df2_23) * 100, 1),\
car2_counts.sum(),\
round(car3_counts.sum() / len(df2_23) * 100, 1),\
car3_counts.sum()

(7.6, 713, 37.0, 3448)

### 230대 거주지

In [ ]:
df2_23['시도'].value_counts()[:5],\
df2_2['시도'].value_counts()[:5],\
df2_3['시도'].value_counts()[:5]

(서울    2910
 경기    1945
 부산    1177
 인천     513
 강원     462
 Name: 시도, dtype: int64,
 경기    436
 부산    378
 서울    271
 강원    250
 인천    100
 Name: 시도, dtype: int64,
 서울    2639
 경기    1509
 부산     799
 인천     413
 충남     411
 Name: 시도, dtype: int64)

In [ ]:
df2_23[df2_23['시도'] == "서울"]['선호관광'].value_counts()[:5],\
df2_2[df2_2['시도'] == "경기"]['선호관광'].value_counts()[:5],\
df2_3[df2_3['시도'] == "서울"]['선호관광'].value_counts()[:5]

(해운대    514
 공릉     385
 장흥     149
 주문진     76
 수승대     71
 Name: 선호관광, dtype: int64,
 해운대       50
 대천해수욕장    44
 남원        39
 예당        26
 공릉        17
 Name: 선호관광, dtype: int64,
 해운대    492
 공릉     363
 장흥     143
 수승대     71
 주문진     70
 Name: 선호관광, dtype: int64)

In [ ]:
df2_1456['시도'].value_counts()[:5],\
df2_1456[df2_1456['시도'] == "서울"]['선호관광'].value_counts()[:5]

(서울    2478
 경기    1329
 부산     417
 전북     247
 광주     245
 Name: 시도, dtype: int64,
 해운대    204
 봉은사    101
 공릉     100
 울릉도     84
 주문진     81
 Name: 선호관광, dtype: int64)

# df3 : 등산로 관심인구 관심사/관심분야 (포털 검색 분야) 정보(포털 검색 분야) 정보 (Total : 873,021)

In [ ]:
df3.head()

,주요관심,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,TV연예,배우 윤주빈 알고보니 윤봉길 의사 종손…3.1절 기념식 편지낭독 :: 네이버 TV연예,F,4,"주부 (전업주부, 파트타임 근무 주부)",300~399만원,예,자녀 있음,아파트/ 주상복합,경기,의정부시,호원1동,NaN
1,TV연예,[단독]정인선 조보아 이어 골목식당 새 MC :: 네이버 TV연예,F,4,"주부 (전업주부, 파트타임 근무 주부)",300~399만원,예,자녀 있음,아파트/ 주상복합,경기,의정부시,호원1동,NaN
2,TV연예,윤주빈 3.1절 편지 낭독→윤봉길 종손 화제→꽃길 응원 봇물[스타이슈] :: 네이버...,F,4,"주부 (전업주부, 파트타임 근무 주부)",300~399만원,예,자녀 있음,아파트/ 주상복합,경기,의정부시,호원1동,NaN
3,TV연예,‘해투4’ 박유나 “김보라 ‘왜 또 나가냐’고”→전현무 “지금 정신없을 때” :: ...,F,4,"주부 (전업주부, 파트타임 근무 주부)",300~399만원,예,자녀 있음,아파트/ 주상복합,경기,의정부시,호원1동,NaN
4,TV연예,박유천 전 연인 황하나 의미심장 글…“남자 하나 잘못 만나 별일 다 겪네” :: 네...,F,4,"주부 (전업주부, 파트타임 근무 주부)",300~399만원,예,자녀 있음,아파트/ 주상복합,경기,의정부시,호원1동,NaN

### AGE

In [ ]:
age_counts = df3['연령'].value_counts()
age_counts

3    350798
4    277820
2    124283
5    115338
1      2783
6      1999
Name: 연령, dtype: int64

In [ ]:
age_counts.loc[[2,3]].sum(), round(age_counts.loc[[2,3]].sum() / age_counts.sum() * 100, 1),\
age_counts.loc[2], round(age_counts.loc[2] / age_counts.sum() * 100, 1),\
age_counts.loc[3], round(age_counts.loc[3] / age_counts.sum() * 100, 1),\
age_counts.drop([2,3]).sum(), round(age_counts.drop([2,3]).sum() / age_counts.sum() * 100, 1)

(475081, 54.4, 124283, 14.2, 350798, 40.2, 397940, 45.6)

In [ ]:
df3_23 = df3[df3['연령'].isin([2, 3])]
df3_2 = df3[(df3['연령'] == 2)]
df3_3 = df3[(df3['연령'] == 3)]
df3_1456 = df3[df3['연령'].isin([1, 4, 5, 6])]

### 230대 성별

In [ ]:
sex_counts = df3_23['성별'].value_counts()
sex_counts

M    257833
F    217248
Name: 성별, dtype: int64

In [ ]:
round(sex_counts.loc['F'] / sex_counts.sum() * 100 , 1),\
round(sex_counts.loc['M'] / sex_counts.sum() * 100 , 1)

(45.7, 54.3)

### 230대 직업

In [ ]:
job_counts = df3_23['직업'].value_counts()
job_counts

사무직 (일반사무직, 공무원, 직업군인)             165935
학생 (초중고학생, 대학생, 대학원생)               73464
주부 (전업주부, 파트타임 근무 주부)               50836
전문직 (의사, 판검사, 예술가, 종교인)             35699
기능직 (자동차정비, 운전기사, 안경사, 택시기사)        30363
무직                                  28486
자영업 (도소매업, 숙박업, 미용업)                22341
교직 (교사, 유치원교사, 학원강사)                20937
생산/노무직 (생산감독, 경비원, 공장근로자)           14491
기타                                  12217
관리직 (사장, 간부, 고위공무원)                  9418
서비스직 (요식업, 숙박업, 미용실종업원)              5767
퇴직/연금생활자                             3176
판매직 (상점점원, 보험설계사, 노점상)               1378
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)       240
Name: 직업, dtype: int64

In [ ]:
drop_jobs = job_counts[job_counts.index.str.contains('학생|퇴직|주부')]
drop_jobs # 28486 무직

학생 (초중고학생, 대학생, 대학원생)    73464
주부 (전업주부, 파트타임 근무 주부)    50836
퇴직/연금생활자                  3176
Name: 직업, dtype: int64

In [ ]:
round((job_counts.sum() - drop_jobs.sum() - 28486) / len(df3_23) * 100, 1),\
job_counts.sum() - drop_jobs.sum() - 28486

(67.1, 318786)

In [ ]:
job2_counts = df3_2['직업'].value_counts() # 6011 무직
job3_counts = df3_3['직업'].value_counts() # 22475 무직

In [ ]:
drop2_jobs = job2_counts[job2_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs = job3_counts[job3_counts.index.str.contains('학생|퇴직|주부')]

In [ ]:
round((job2_counts.sum() - drop2_jobs.sum() - 6011) / len(df3_23) * 100, 1),\
job2_counts.sum() - drop2_jobs.sum() - 6011,\
round((job3_counts.sum() - drop3_jobs.sum() - 22475) / len(df3_23) * 100, 1),\
job3_counts.sum() - drop3_jobs.sum() - 22475

(12.8, 60574, 54.4, 258212)

### 230대 자동차

In [ ]:
car_counts = df3_23['자동차'].value_counts()
car_counts

중형차 (쏘나타, K5, 말리부, 골프급 등)           63086
준중형차 (아반떼, K3, 크루즈, 제타급 등)          49419
준중형SUV (투싼, 스포티지, QM5, 티구안급 등)      40899
경차 (모닝, 스파크 등)                      27160
준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)    20486
대형SUV (베라크루즈, 모하비, 투아렉급 등)          11185
중형SUV (싼타페, 쏘렌토, 캡티바, BMW X3급 등)    11171
소형SUV/CUV (티볼리, QM3 등)               7242
소형차 (액센트, 프라이드, 아베오, 피아트급 등)         4985
MPV (카니발, 올란도, 피카소급, 오딧세이 등)         2727
대형차 (제너시스, BMW5급 등)                  2574
기타 (승합차/트럭/화물차/기타 차량 등)              1441
스포츠 (제네시스 쿠페, BMW M, 벤츠 AMG 등)        856
준중형파생 (벨로스터, I30 등)                   257
프리미엄 (에쿠스, BMW7급 등)                    44
Name: 자동차, dtype: int64

In [ ]:
round(car_counts.sum() / len(df3_23) * 100, 1),\
car_counts.sum()

(51.3, 243532)

In [ ]:
car2_counts = df3_2['자동차'].value_counts()
car3_counts = df3_3['자동차'].value_counts()

round(car2_counts.sum() / len(df3_23) * 100, 1),\
car2_counts.sum(),\
round(car3_counts.sum() / len(df3_23) * 100, 1),\
car3_counts.sum()

(8.4, 40125, 42.8, 203407)

### 230대 거주지

In [ ]:
df3_23['시도'].value_counts()[:5],\
df3_2['시도'].value_counts()[:5],\
df3_3['시도'].value_counts()[:5]
# 주요관심

(서울    171643
 경기    131357
 부산     37246
 인천     35748
 대구     20058
 Name: 시도, dtype: int64,
 서울    27521
 경기    26540
 인천    14691
 대구    11611
 충북    10877
 Name: 시도, dtype: int64,
 서울    144122
 경기    104817
 부산     27045
 인천     21057
 충남     12356
 Name: 시도, dtype: int64)

In [ ]:
df3_23[df3_23['시도'] == "서울"]['주요관심'].value_counts()[:5],\
df3_2[df3_2['시도'] == "서울"]['주요관심'].value_counts()[:5],\
df3_3[df3_3['시도'] == "서울"]['주요관심'].value_counts()[:5]

(스포츠     80067
 TV연예    41600
 사회      30069
 경제      10029
 정치       9326
 Name: 주요관심, dtype: int64,
 스포츠     10127
 TV연예     8505
 경제       4251
 사회       4167
 정치        332
 Name: 주요관심, dtype: int64,
 스포츠     69940
 TV연예    33095
 사회      25902
 정치       8994
 경제       5778
 Name: 주요관심, dtype: int64)

In [ ]:
df3_1456['시도'].value_counts()[:5],\
df3_1456[df3_1456['시도'] == "서울"]['주요관심'].value_counts()[:5]

(서울    174087
 경기     88596
 인천     24956
 대전     22590
 대구     16750
 Name: 시도, dtype: int64,
 스포츠     74998
 사회      60391
 TV연예    25122
 경제       7848
 정치       4710
 Name: 주요관심, dtype: int64)

In [139]:
df3_23[(df3_23['시도'] == "서울") & (df3_23['자동차'].notnull())]

,주요관심,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
12,TV연예,왜그래 풍상씨 유준상 NG 없는 완벽 연기…반박불가 인생캐 :: 네이버 TV연예,F,3,"사무직 (일반사무직, 공무원, 직업군인)",800~899만원,아니오,,아파트/ 주상복합,서울,동대문구,장안1동,"중형차 (쏘나타, K5, 말리부, 골프급 등)"
13,TV연예,박유천 前 여친 황하나 다 폭로할 것→돌연 삭제…이틀째 실검장악 [종합] :: 네이...,F,3,"사무직 (일반사무직, 공무원, 직업군인)",800~899만원,아니오,,아파트/ 주상복합,서울,동대문구,장안1동,"중형차 (쏘나타, K5, 말리부, 골프급 등)"
14,TV연예,김정훈 가장 큰 죄는 거짓말…변명 불가한 실수 [MK체크] :: 네이버 TV연예,F,3,"사무직 (일반사무직, 공무원, 직업군인)",800~899만원,아니오,,아파트/ 주상복합,서울,동대문구,장안1동,"중형차 (쏘나타, K5, 말리부, 골프급 등)"
23,스포츠,사바하 유지태 미스터리한 존재감으로 강렬한 눈도장 :: 네이버 TV연예,M,3,"사무직 (일반사무직, 공무원, 직업군인)",600~699만원,아니오,,연립주택/ 다세대/ 빌라,서울,동대문구,답십리2동,"경차 (모닝, 스파크 등)"
24,스포츠,사바하 유지태 미스터리한 존재감으로 강렬한 눈도장 :: 네이버 TV연예,M,3,"사무직 (일반사무직, 공무원, 직업군인)",600~699만원,아니오,,연립주택/ 다세대/ 빌라,서울,동대문구,답십리2동,"경차 (모닝, 스파크 등)"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
872694,스포츠,뛰고 싶은 자이언-쓰고 싶은 NOP 그래도 조심 또 조심 :: 네이버스포츠,M,3,"기능직 (자동차정비, 운전기사, 안경사, 택시기사)",600~699만원,아니오,,연립주택/ 다세대/ 빌라,서울,양천구,신월3동,"중형차 (쏘나타, K5, 말리부, 골프급 등)"
872695,스포츠,행복 농구 하워드 벤치에서 나오는 게 즐겁다 :: 네이버스포츠,M,3,"기능직 (자동차정비, 운전기사, 안경사, 택시기사)",600~699만원,아니오,,연립주택/ 다세대/ 빌라,서울,양천구,신월3동,"중형차 (쏘나타, K5, 말리부, 골프급 등)"
872696,스포츠,고향 배신했다 분노한 팬들…불에 탄 즐라탄 동상 :: 네이버스포츠,M,3,"기능직 (자동차정비, 운전기사, 안경사, 택시기사)",600~699만원,아니오,,연립주택/ 다세대/ 빌라,서울,양천구,신월3동,"중형차 (쏘나타, K5, 말리부, 골프급 등)"
872697,스포츠,농구 : 네이버 스포츠,M,3,"기능직 (자동차정비, 운전기사, 안경사, 택시기사)",600~699만원,아니오,,연립주택/ 다세대/ 빌라,서울,양천구,신월3동,"중형차 (쏘나타, K5, 말리부, 골프급 등)"
872777,스포츠,세세뇽 손흥민 백업으로? 무리뉴 그는 왼쪽 윙어 :: 네이버스포츠,M,3,"자영업 (도소매업, 숙박업, 미용업)",700~799만원,아니오,,아파트/ 주상복합,서울,강남구,논현1동,"대형차 (제너시스, BMW5급 등)"

In [145]:
df3_23[(df3_23['시도'] == "서울") & (df3_23['자동차'].notnull())]['구'].value_counts()[:5]

광진구     11176
양천구     10081
송파구      9660
서대문구     8907
관악구      8336
Name: 구, dtype: int64

In [146]:
df3_2[(df3_2['시도'] == "서울") & (df3_2['자동차'].notnull())]['구'].value_counts()[:5]

송파구     3477
광진구     2066
종로구     1478
서대문구     800
은평구      508
Name: 구, dtype: int64